#pragma once

// Name: DQXIS, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// Class JackGame.Jack3StepAnimActor
// 0x00C0 (0x0458 - 0x0398)
class AJack3StepAnimActor : public AActor
{
public:
	class UAnimMontage*                                FinishAnim;                                               // 0x0398(0x0008) (Edit, BlueprintVisi, ZeroConstructor, IsPlainOldData)
	struct FName                                       FinishAnimWithName;                                       // 0x03A0(0x0008) (Edit, BlueprintVisi, ZeroConstructor, IsPlainOldData)
	float                                              FinishAnimActionSec;                                      // 0x03A8(0x0004) (Edit, BlueprintVisi, ZeroConstructor, IsPlainOldData)
	float                                              FinishInputOffSec;                                        // 0x03AC(0x0004) (Edit, BlueprintVisi, ZeroConstructor, IsPlainOldData)
	float                                              FinishInputAllSec;                                        // 0x03B0(0x0004) (Edit, BlueprintVisi, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x03B4(0x0004) MISSED OFFSET
	struct FName                                       GmmickDropItemId;                                         // 0x03B8(0x0008) (Edit, BlueprintVisi, ZeroConstructor, IsPlainOldData)
	struct FName                                       RespawnSaveFlagName;                                      // 0x03C0(0x0008) (Edit, BlueprintVisi, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x28];                                      // 0x03C8(0x0028) MISSED OFFSET
	struct FName                                       UsePropGadgetId;                                          // 0x03F0(0x0008) (Edit, BlueprintVisi, ZeroConstructor, IsPlainOldData)
	struct FName                                       UsePropOugonTuruhasiGadgetId;                             // 0x03F8(0x0008) (Edit, BlueprintVisi, ZeroConstructor, IsPlainOldData)
	bool                                               bAllwaysDrop;                                             // 0x0400(0x0001) (Edit, BlueprintVisi, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x57];                                      // 0x0401(0x0057) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class JackGame.Jack3StepAnimActor");
		return ptr;
	}


	void UpdateDropIdEnd();
	void UpdateDropId();
	void SyncSaveData();
	void SpawnDropMoveParabolaEffect(class UParticleSystemComponent* Particle, const struct FVector& Start, const struct FVector& End, float AddZ, float GravZ);
	void STATIC_ShakeCamera(class AJackCharacter* InAnimCharacter, const struct FName& ShakeName, float Scale);
	void SetInput(class AJackCharacter* InAnimCharacter);
	void OnInteractionEnable();
	void OnDebugRespawn();
	void OnActionEnd(class AJackCharacter* InAnimCharacter, bool bFinish);
	void OnAction(class AJackCharacter* InAnimCharacter, bool bFinish);
	bool IsUseOugonNoTuruhasi();
	bool IsDropOk();
	bool IsActionEnd();
	void InitDropParams(float InGmmickDropItemSec, const struct FName& SaveFlag, TArray<struct FName> InDropItemIdArray, TArray<int> InDropItemNumArray);
	struct FName GetUsePropGadgetId();
	TArray<float> GetDropMoveParabolaParam(const struct FVector& Start, const struct FVector& End, float AddZ, float GravZ);
	int GetDropItemNum();
	struct FName GetDropItemId();
	void GetDropItemData(TArray<struct FName>* OutId, TArray<int>* OutNum);
	void ForceSetReplacementSec(float Sec);
	void DetachGadgetObject();
	void CallOnActionEnd(class AJackCharacter* InAnimCharacter);
	void CallOnAction(class AJackCharacter* InAnimCharacter);
	void AttachGadgetObject();
	void AddSpawnedKira(class AJackItemGettableObjectBase* Item);
};


// Class JackGame.JackAchievementManager
// 0x06E8 (0x0720 - 0x0038)
class UJackAchievementManager : public UObject
{
public:
	class UDataTable*                                  AchievementDataTable;                                     // 0x0038(0x0008) (Edit, BlueprintVisi, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UDataTable*                                  AchievementPhoneticDataTable;                             // 0x0040(0x0008) (Edit, BlueprintVisi, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<EJackGameFlagCategory>                 SuppressFlagCategory_PossessionItemCount;                 // 0x0048(0x0001) (Edit, BlueprintVisi, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0049(0x0007) MISSED OFFSET
	struct FName                                       SuppressFlag_PossessionItemCount;                         // 0x0050(0x0008) (Edit, BlueprintVisi, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6C8];                                     // 0x0058(0x06C8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class JackGame.JackAchievementManager");
		return ptr;
	}


	void ReacquiredJackUE4Achievement(TEnumAsByte<EJackAchievementCategory> InCategory, TEnumAsByte<EJackAchievementCondition> InCondition);
	void NotUnlockUE4Achievements(bool bIsNotUnlock);
	void LockAllAchievements();
	void Latent_UnlockUE4Achievement(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, const struct FName& AchievementID);
	bool IsQueueingAchievement(TEnumAsByte<EJackAchievementTiming> Timing);
	bool IsAcquiredAchievement(const struct FJackLDT_Achievement& LDT_Achievement);
	bool IsAchievementSyinpaisyou();
	void GetTripleAchievementNoForUnacquiredTrophy(int InCategory, TArray<int>* OutTripleAchievementNoList);
	struct FString GetStringParameter(const struct FJackLDT_Achievement& LDT_Achievement);
	TArray<struct FName> GetSenrekiAchievementList();
	int GetNumericalParameter(const struct FJackLDT_Achievement& LDT_Achievement);
	struct FString GetDescription(const struct FJackLDT_Achievement& LDT_Achievement);
	struct FName GetAchievementQueue(TEnumAsByte<EJackAchievementTiming> Timing);
	struct FString GetAchievementName(const struct FJackLDT_Achievement& LDT_Achievement);
	void EnableAcquisitionsTrophy();
	void DisableAchievementAcquisition(bool bDisable);
	void CheckAcquiredAchievementTrophyList();
	void AcquireAchievementDirect(const struct FJackLDT_Achievement& LDT_Achievement);
};


// Class JackGame.JackActionAIEvaluateScoreCheck
// 0x0178 (0x0510 - 0x0398)
class AJackActionAIEvaluateScoreCheck : public AActor
{
public:
	struct FName                                       RenkeiID;                                                 // 0x0398(0x0008) (Edit, BlueprintVisi, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData)
	TEnumAsByte<EJackPlayerAIActionControl>            ActionContrlType;                                         // 0x03A0(0x0001) (Edit, BlueprintVisi, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x03A1(0x0007) MISSED OFFSET
	struct FJackActionData                             ActionData;                                               // 0x03A8(0x00B0) (Edit, BlueprintVisi, BlueprintReadOnly, Transient, EditConst)
	struct FJackActionScoreResult                      ActionScoreResult;                                        // 0x0458(0x0068) (Edit, BlueprintVisi, BlueprintReadOnly, Transient, EditConst)
	struct FJackDataTableActionAIEvaluateScoreCheck    ScoreCheckRow;                                            // 0x04C0(0x0030) (Edit, BlueprintVisi, BlueprintReadOnly, Transient, EditConst)
	TWeakObjectPtr<class UJackGameCharacter>           CasterGameCharacter;                                      // 0x04F0(0x0008) (Edit, BlueprintVisi, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData)
	TArray<struct FName>                               CasterActionHistory;                                      // 0x04F8(0x0010) (Edit, BlueprintVisi, BlueprintReadOnly, ZeroConstructor, Transient, EditConst)
	TWeakObjectPtr<class UJackGameCharacter>           TargetGameCharacter;                                      // 0x0508(0x0008) (Edit, BlueprintVisi, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class JackGame.JackActionAIEvaluateScoreCheck");
		return ptr;
	}


	float SC_EvalScoreRevival();
	float SC_EvalScoreMetalUncertainAttack();
	float SC_EvalScoreMetalAttack();
	float SC_EvalScoreIceWave();
	float SC_EvalScoreHealMp();
	float SC_EvalScoreHealHp();
	float SC_EvalScoreGiveAttribute();
	float SC_EvalScoreDefenseUp();
	float SC_EvalScoreDefenseDown();
	float SC_EvalScoreDefense();
	float SC_EvalScoreDead();
	float SC_EvalScoreCureVenom();
	float SC_EvalScoreCurePoison();
	float SC_EvalScoreCureNoact();
	float SC_EvalScoreCureDazzle();
	float SC_EvalScoreCure();
	float SC_EvalScoreContinuedDamageBig();
	float SC_EvalScoreContinuedDamage();
	float SC_EvalScoreAttackUp();
	float SC_EvalScoreAttackDown();
	float SC_EvalScoreAttackBig();
	float SC_EvalScoreAttack2();
	float SC_EvalScoreAttack();
	float SC_EvalScoreAddAbnormal();
	int IsTargetZone(class UJackGameCharacter* TargetCharacter);
	int IsTargetSyubiryokuSlideUp(class UJackGameCharacter* TargetCharacter);
	int IsTargetOddEffect(class UJackGameCharacter* TargetCharacter, EJackOddEffectCategoryType InCategoryType);
	int IsTargetMetal(class UJackGameCharacter* TargetCharacter);
	int IsTargetKougekiryokuSlideUp(class UJackGameCharacter* TargetCharacter);
	int IsTargetJumonMukou(class UJackGameCharacter* TargetCharacter);
	int IsTargetJumonHansya(class UJackGameCharacter* TargetCharacter);
	int IsTargetGiveAttribute();
	int IsTargetDazzleCureEnable(bool InSlide, struct FJackActionCalcValue* CalcValue);
	int IsTargetButuriKanzenGuard(class UJackGameCharacter* TargetCharacter);
	int IsTargetAttackUpEnable(bool InSlide, struct FJackActionCalcValue* CalcValue);
	int IsTargetActionHeal(TArray<struct FName> InActionList);
	int IsResultMaxHpKill();
	int IsResultKill(TArray<struct FJackActionKill>* KillList);
	int IsResultHit(TArray<struct FJackActionOddEffectCollect>* CollectList);
	int IsResultDeath();
	int IsResultActionNormal();
	int IsRenkeiAction();
	int IsMetalEnableAction();
	int IsCriticalCertaintyAction();
	int IsCasterZone();
	int IsActionClearPoison();
	int IsActionClearNoact();
	int IsActionClearDazzle();
	int IsActionClearConditionAbnormality();
	float GetTargetZoneCoefficient(TArray<struct FJackActionValue>* ValueList);
	float GetTargetSyubiryoku(bool InSlide, TArray<struct FJackActionValue>* ValueList);
	float GetTargetNemuriCorrectCoefficient(TArray<struct FJackActionValue>* ValueList);
	float GetTargetNemuriCoefficient(TArray<struct FJackActionValue>* ValueList);
	float GetTargetMpRate(int* OutMp, int* OutMaxMp, TArray<struct FJackActionCalcRate>* CalcList);
	float GetTargetMetalExpCoefficient(TArray<struct FJackActionValue>* ValueList);
	float GetTargetMetalCoefficient(TArray<struct FJackActionValue>* ValueList);
	float GetTargetKougekiryoku(bool InSlide, TArray<struct FJackActionValue>* ValueList);
	float GetTargetHpRate(int* OutHp, int* OutMaxHp, TArray<struct FJackActionCalcRate>* CalcList);
	float GetTargetAttackRankCoefficient(TArray<struct FJackActionValue>* CalcValueList);
	float GetTargetActionRevive(TArray<struct FName> InActionList);
	void GetTargetActionList(bool InAliveOnly, TArray<struct FName>* OutActionList);
	float GetScoreCorrectionFactor();
	int GetResultUseMp();
	float GetResultTargetMpHealRate(TArray<struct FJackActionCalcRate>* CalcList);
	TArray<class UJackGameCharacter*> GetResultTargetList();
	float GetResultTargetHpHealRate(TArray<struct FJackActionCalcRate>* CalcList);
	float GetResultSyubiryokuSlideChangeValue(TArray<struct FJackSlideActionCalc>* CalcList);
	float GetResultSyubiryokuSlideAddCoefficient(TArray<struct FJackSlideAction>* CalcList);
	float GetResultRevive();
	float GetResultOddEffectSuccessPer(TArray<struct FJackActionOddEffectCollect>* CollectList);
	float GetResultKougekiryokuSlideChangeValue(TArray<struct FJackSlideActionCalc>* CalcList);
	int GetResultKillMetal(TArray<struct FJackActionKill>* KillList);
	int GetResultKill(TArray<struct FJackActionKill>* KillList);
	float GetResultDamageSuccessPer(TArray<struct FJackActionOddEffectCollect>* CollectList);
	float GetResultDamageRateMetal(TArray<struct FJackActionCalcRate>* CalcList);
	float GetResultDamageRate2(TArray<struct FJackActionKill>* KillList, TArray<struct FJackActionCalcRate>* CalcList);
	float GetResultDamageRate(TArray<struct FJackActionCalcRate>* CalcList);
	float GetResultDamageHitRateMetal(TArray<struct FJackActionValue>* ValueList);
	int GetResultDamage();
	float GetResultAutoHpHeal();
	float GetRandom();
	float GetEnemyGroupGiveAttributeParam();
	float GetContinuedDamageCoefficient();
	float GetCasterUseMpImpactCoefficient();
	float GetCasterDazzleCorrectCoefficient();
	float GetCasterActionHistory();
	float GetActionHitPerCorrection();
};


// Class JackGame.JackActionCalcDamage
// 0x0000 (0x0038 - 0x0038)
class UJackActionCalcDamage : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class JackGame.JackActionCalcDamage");
		return ptr;
	}


	struct FJackActionCalcDamageResult STATIC_CalcDamageBP(class UJackGameCharacter* InAttacker, class UJackGameCharacter* InDamager, struct FJackActionData* ActionData);
};


// Class JackGame.JackActionCameraDatabase
// 0x0000 (0x0038 - 0x0038)
class UJackActionCameraDatabase : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class JackGame.JackActionCameraDatabase");
		return ptr;
	}

};


// Class JackGame.JackActionCursorControllerComponent
// 0x0088 (0x01B0 - 0x0128)
class UJackActionCursorControllerComponent : public UActorComponent
{
public:
	struct FJackInteractorRange                        FieldAttackShortRange;                                    // 0x0128(0x0014) (Edit, DisableEditOnInstance)
	struct FJackInteractorRange                        FieldAttackLongRange;                                     // 0x013C(0x0014) (Edit, DisableEditOnInstance)
	struct FJackInteractorRange                        FieldAttackBowgunRange;                                   // 0x0150(0x0014) (Edit, DisableEditOnInstance)
	struct FJackInteractorRange                        FieldAttackSearchRange;                                   // 0x0164(0x0014) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData00[0x30];                                      // 0x0178(0x0030) MISSED OFFSET
	float                                              DisplayActionGuideRadius;                                 // 0x01A8(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x01AC(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class JackGame.JackActionCursorControllerComponent");
		return ptr;
	}


	void OnFocusedInteractiveActorComponentPropertyChanged();
	void OnCompletedInteraction(class UJackInteractorComponent* InInteractorComponent, class UJackInteractiveActorComponent* InInteractiveActorComponent);
};


// Class JackGame.JackActionDatabase
// 0x0000 (0x0038 - 0x0038)
class UJackActionDatabase : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class JackGame.JackActionDatabase");
		return ptr;
	}


	struct FJackDataTableActionSecondCheck STATIC_GetDTActionSecondCheckRow(EJackBattleIntelligenceType IntelligenceType, struct FJackActionData* ActionData);
	struct FName STATIC_GetDTActionSecondCheckID(EJackBattleIntelligenceType IntelligenceType, struct FJackActionData* ActionData);
	struct FJackDataTableAction STATIC_GetDTActionRow(struct FJackActionData* ActionData);
	struct FJackDataTableActionOddEffect STATIC_GetDTActionOddEffectRow(struct FJackActionData* ActionData);
	struct FJackDataTableActionMultiAttack STATIC_GetDTActionMultiAttackRow(struct FJackActionData* ActionData);
	struct FJackDataTableActionHitOrder STATIC_GetDTActionHitOrderRow(struct FJackActionData* ActionData);
	struct FJackDataTableActionDamage STATIC_GetDTActionDamageRow(struct FJackActionData* ActionData);
	struct FJackActionData GetActionData(const struct FName& ActionID, bool bWarnIfMissing);
};


// Class JackGame.JackActionEffect
// 0x03D8 (0x0770 - 0x0398)
class AJackActionEffect : public AActor
{
public:
	struct FScriptMulticastDelegate                    OnMovementAttachProgressCompleteDelegate;                 // 0x0398(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnMovementCompleteDelegate;                               // 0x03A8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnSpawnHitEffectDelegate;                                 // 0x03B8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnRequestDestroyDelegate;                                 // 0x03C8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnMovementAttachProgressStartDelegate;                    // 0x03D8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	EJackActionEffectSpawnHitEffectTiming              SpawnHitEffectTiming;                                     // 0x03E8(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x03E9(0x0003) MISSED OFFSET
	float                                              HitEffectDelayTime;                                       // 0x03EC(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	EJackActionEffectNotifyActionHitTiming             NotifyActionHitTiming;                                    // 0x03F0(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x03F1(0x0003) MISSED OFFSET
	float                                              NotifyActionHitDelayTime;                                 // 0x03F4(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	EJackActionEffectDeactivateDefaultEffectTiming     DeactivateDefaultEffectsTiming;                           // 0x03F8(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bAutoDestroy;                                             // 0x03F9(0x0001) (Edit, BlueprintVisi, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x2];                                       // 0x03FA(0x0002) MISSED OFFSET
	float                                              LifeTime;                                                 // 0x03FC(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              DestroyDelayTime;                                         // 0x0400(0x0004) (Edit, BlueprintVisi, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x4];                                       // 0x0404(0x0004) MISSED OFFSET
	TArray<struct FJackActionEffectTimelineEventEntry> TimelineEventEntries;                                     // 0x0408(0x0010) (Edit, ZeroConstructor)
	struct FJackActionEffectMovementPosition           StartMovementPosition;                                    // 0x0418(0x0030) (Edit)
	struct FJackActionEffectMovementPosition           EndMovementPosition;                                      // 0x0448(0x0030) (Edit)
	TArray<struct FJackActionEffectEffect>             MuzzleEffects;                                            // 0x0478(0x0010) (Edit, ZeroConstructor)
	TArray<struct FJackActionEffectEffect>             DefaultEffects;                                           // 0x0488(0x0010) (Edit, ZeroConstructor)
	TArray<struct FJackActionEffectEffect>             HitEffects;                                               // 0x0498(0x0010) (Edit, ZeroConstructor)
	TArray<struct FJackActionEffectEffect>             DamageEffects;                                            // 0x04A8(0x0010) (Edit, ZeroConstructor)
	float                                              PlayDelayTime;                                            // 0x04B8(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x4];                                       // 0x04BC(0x0004) MISSED OFFSET
	struct FJackActionEffectDecal                      TrailEffect;                                              // 0x04C0(0x0018) (Edit)
	class USphereComponent*                            SphereComp;                                               // 0x04D8(0x0008) (Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, IsPlainOldData)
	class UJackActionEffectMovementComponent*          ActionEffectMovementComp;                                 // 0x04E0(0x0008) (Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UStaticMeshComponent*                        StaticMeshComp;                                           // 0x04E8(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	TArray<TWeakObjectPtr<class UParticleSystemComponent>> MuzzleParticleComps;                                      // 0x04F0(0x0010) (Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, EditConst)
	TArray<TWeakObjectPtr<class UParticleSystemComponent>> DefaultParticleComps;                                     // 0x0500(0x0010) (Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, EditConst)
	TArray<TWeakObjectPtr<class UParticleSystemComponent>> HitParticleComps;                                         // 0x0510(0x0010) (Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, EditConst)
	TArray<TWeakObjectPtr<class UParticleSystemComponent>> DamageParticleComps;                                      // 0x0520(0x0010) (Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, EditConst)
	TArray<TWeakObjectPtr<class UAudioComponent>>      DefaultLoopAudioComps;                                    // 0x0530(0x0010) (Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, EditConst)
	class USphereComponent*                            WorkSphereComp1;                                          // 0x0540(0x0008) (Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, IsPlainOldData)
	class USphereComponent*                            WorkSphereComp2;                                          // 0x0548(0x0008) (Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, IsPlainOldData)
	class USphereComponent*                            WorkSphereComp3;                                          // 0x0550(0x0008) (Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, IsPlainOldData)
	class USphereComponent*                            WorkSphereComp4;                                          // 0x0558(0x0008) (Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, IsPlainOldData)
	class USphereComponent*                            WorkSphereComp5;                                          // 0x0560(0x0008) (Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, IsPlainOldData)
	class USphereComponent*                            WorkSphereComp6;                                          // 0x0568(0x0008) (Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, IsPlainOldData)
	class USphereComponent*                            WorkSphereComp7;                                          // 0x0570(0x0008) (Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, IsPlainOldData)
	class USphereComponent*                            WorkSphereComp8;                                          // 0x0578(0x0008) (Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, IsPlainOldData)
	class UJackActionEffectMovementComponent*          WorkMovementComp1;                                        // 0x0580(0x0008) (Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, IsPlainOldData)
	class UJackActionEffectMovementComponent*          WorkMovementComp2;                                        // 0x0588(0x0008) (Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, IsPlainOldData)
	class UJackActionEffectMovementComponent*          WorkMovementComp3;                                        // 0x0590(0x0008) (Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, IsPlainOldData)
	class UJackActionEffectMovementComponent*          WorkMovementComp4;                                        // 0x0598(0x0008) (Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, IsPlainOldData)
	class UJackActionEffectMovementComponent*          WorkMovementComp5;                                        // 0x05A0(0x0008) (Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, IsPlainOldData)
	class UJackActionEffectMovementComponent*          WorkMovementComp6;                                        // 0x05A8(0x0008) (Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, IsPlainOldData)
	class UJackActionEffectMovementComponent*          WorkMovementComp7;                                        // 0x05B0(0x0008) (Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, IsPlainOldData)
	class UJackActionEffectMovementComponent*          WorkMovementComp8;                                        // 0x05B8(0x0008) (Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, IsPlainOldData)
	bool                                               bSpawnHitEffectComplete;                                  // 0x05C0(0x0001) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	bool                                               bTimelineEventComplete;                                   // 0x05C1(0x0001) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	bool                                               bMovementCompAttachProgressComplete;                      // 0x05C2(0x0001) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	bool                                               bMovementCompComplete;                                    // 0x05C3(0x0001) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	bool                                               bDeactivateDefaultEffectsComplete;                        // 0x05C4(0x0001) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	bool                                               bRequestDestroyComplete;                                  // 0x05C5(0x0001) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	unsigned char                                      UnknownData05[0x2];                                       // 0x05C6(0x0002) MISSED OFFSET
	TWeakObjectPtr<class AActor>                       CasterActor;                                              // 0x05C8(0x0008) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	TWeakObjectPtr<class AActor>                       TargetActor;                                              // 0x05D0(0x0008) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	class AActor*                                      ExposeCasterActor;                                        // 0x05D8(0x0008) (Edit, BlueprintVisi, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	class AActor*                                      ExposeTargetActor;                                        // 0x05E0(0x0008) (Edit, BlueprintVisi, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	unsigned char                                      UnknownData06[0x8];                                       // 0x05E8(0x0008) MISSED OFFSET
	struct FTimeline                                   TimelineEvent;                                            // 0x05F0(0x00E0) (Edit, DisableEditOnTemplate)
	int                                                CurrentTimelineEventIndex;                                // 0x06D0(0x0004) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	unsigned char                                      UnknownData07[0x4];                                       // 0x06D4(0x0004) MISSED OFFSET
	TArray<struct FTimerHandle>                        TimerHandles;                                             // 0x06D8(0x0010) (Edit, ZeroConstructor, DisableEditOnTemplate)
	bool                                               bIsPlayStart;                                             // 0x06E8(0x0001) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	bool                                               bIsFireReservedEffect2;                                   // 0x06E9(0x0001) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	unsigned char                                      UnknownData08[0x2];                                       // 0x06EA(0x0002) MISSED OFFSET
	float                                              TotalDecalAddSize;                                        // 0x06EC(0x0004) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	TArray<float>                                      WorkTotalDecalAddSizes;                                   // 0x06F0(0x0010) (Edit, ZeroConstructor, DisableEditOnTemplate)
	struct FVector                                     DecalCacheLocation;                                       // 0x0700(0x000C) (Edit, DisableEditOnTemplate, IsPlainOldData)
	unsigned char                                      UnknownData09[0x4];                                       // 0x070C(0x0004) MISSED OFFSET
	TArray<struct FVector>                             WorkMoveDecalCacheLocations;                              // 0x0710(0x0010) (Edit, ZeroConstructor, DisableEditOnTemplate)
	struct FVector                                     PACheckCacheLocation;                                     // 0x0720(0x000C) (Edit, DisableEditOnTemplate, IsPlainOldData)
	unsigned char                                      UnknownData10[0x4];                                       // 0x072C(0x0004) MISSED OFFSET
	TArray<TWeakObjectPtr<class AActor>>               AttachActors;                                             // 0x0730(0x0010) (Edit, ZeroConstructor, DisableEditOnTemplate)
	TArray<TWeakObjectPtr<class AActor>>               JumonhansyaTargets;                                       // 0x0740(0x0010) (Edit, ZeroConstructor, DisableEditOnTemplate)
	bool                                               bAbort;                                                   // 0x0750(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData11[0x7];                                       // 0x0751(0x0007) MISSED OFFSET
	TArray<struct FJackBlendablePostProcessSettingsData> PostBlendableData;                                        // 0x0758(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData12[0x8];                                       // 0x0768(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class JackGame.JackActionEffect");
		return ptr;
	}


	void SetTargetActor(class AActor* InTargetActor);
	void SetFireReservedEfect2(bool bInFireReservedEffect2);
	void SetCasterActor(class AActor* InCasterActor);
	void OnTimelineEvent();
	class AActor* GetTargetActor();
	class AActor* GetCasterActor();
	bool GetBlurScreenV2(EJackActionEffectCategory EffectCategory, struct FVector2D* OutV2);
	TArray<class AActor*> GetAttachActors();
	class UJackActionEffectMovementComponent* GetActionEffectMovementComponent();
	void Delegate__DelegateSignature();
	void AttachToOtherActionEffect(class AActor* ParentActor, const struct FName& SocketName, EAttachmentRule AttachRule, bool bWeldSimulatedBodies, bool bCallTeleport);
	void AddJumonhansyaTarget(class AActor* JumonhansyaTarget);
	void AddAttachActor(class AActor* AttachActor);
};


// Class JackGame.JackActionEffectData
// 0x00A8 (0x00E0 - 0x0038)
class UJackActionEffectData : public UObject
{
public:
	TArray<struct FJackActionAttachedParticle>         CastParticles;                                            // 0x0038(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FJackActionAttachedParticle>         CastParticles_H;                                          // 0x0048(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FJackActionAttachedParticle>         CastParticles_S;                                          // 0x0058(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FJackActionAttachedParticle>         CastParticles_M;                                          // 0x0068(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FJackActionAttachedParticle>         CastParticles_L;                                          // 0x0078(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FJackActionAttachedParticle>         CastParticles_LL;                                         // 0x0088(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<class UClass*>                              ShotActionEffectClasses;                                  // 0x0098(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	EJackActionEffectBehaviorType                      ShotBehavior;                                             // 0x00A8(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bBurstEffectSnapToGround;                                 // 0x00A9(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x00AA(0x0006) MISSED OFFSET
	TArray<struct FJackActionSpawnedProjectile>        ShotProjectiles;                                          // 0x00B0(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FJackActionSpawnedBurstEffect>       ShotBurstEffects;                                         // 0x00C0(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FJackActionAttachedParticle>         ShotParticles;                                            // 0x00D0(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class JackGame.JackActionEffectData");
		return ptr;
	}

};


// Class JackGame.JackActionEffectMovementComponent
// 0x01C8 (0x0340 - 0x0178)
class UJackActionEffectMovementComponent : public UMovementComponent
{
public:
	bool                                               bRotationFollowsVelocity;                                 // 0x0178(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bPlanarMovementFrontRotation;                             // 0x0179(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x017A(0x0006) MISSED OFFSET
	class UCurveFloat*                                 AttachProgressCurve;                                      // 0x0180(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              AttachProgressCurveTimeScale;                             // 0x0188(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x018C(0x0004) MISSED OFFSET
	class UCurveFloat*                                 MissileProgressCurve;                                     // 0x0190(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UCurveVector*                                LocationCurve;                                            // 0x0198(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FVector                                     LocationCurveScale;                                       // 0x01A0(0x000C) (Edit, IsPlainOldData)
	EJackRandomCalcType                                LocationRandomCalcTypeX;                                  // 0x01AC(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	EJackRandomCalcType                                LocationRandomCalcTypeY;                                  // 0x01AD(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	EJackRandomCalcType                                LocationRandomCalcTypeZ;                                  // 0x01AE(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x1];                                       // 0x01AF(0x0001) MISSED OFFSET
	class UCurveVector*                                LocationRandomCurve;                                      // 0x01B0(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FVector                                     LocationRandomCurveScale;                                 // 0x01B8(0x000C) (Edit, IsPlainOldData)
	unsigned char                                      UnknownData03[0x4];                                       // 0x01C4(0x0004) MISSED OFFSET
	class UCurveVector*                                RotationCurve;                                            // 0x01C8(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UCurveVector*                                RotationPivotCurve;                                       // 0x01D0(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UCurveVector*                                OrbitSpeedCurve;                                          // 0x01D8(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UCurveVector*                                OrbitRadiusCurve;                                         // 0x01E0(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FVector                                     OrbitRadiusCurveScale;                                    // 0x01E8(0x000C) (Edit, IsPlainOldData)
	struct FRotator                                    OrbitInitialRotation;                                     // 0x01F4(0x000C) (Edit, IsPlainOldData)
	class UCurveVector*                                ScaleCurve;                                               // 0x0200(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FVector                                     ScaleCurveScale;                                          // 0x0208(0x000C) (Edit, IsPlainOldData)
	float                                              BaseDistance;                                             // 0x0214(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bAttachWorld;                                             // 0x0218(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bEndAttachGround;                                         // 0x0219(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bOffRollByRotationFollowsVelocity;                        // 0x021A(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x1];                                       // 0x021B(0x0001) MISSED OFFSET
	float                                              bPlaying;                                                 // 0x021C(0x0004) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	struct FJackAttachInfo                             StartAttachInfo;                                          // 0x0220(0x0038) (Edit, DisableEditOnTemplate)
	struct FJackAttachInfo                             EndAttachInfo;                                            // 0x0258(0x0038) (Edit, DisableEditOnTemplate)
	float                                              ProgressTime;                                             // 0x0290(0x0004) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	unsigned char                                      UnknownData05[0xC];                                       // 0x0294(0x000C) MISSED OFFSET
	struct FTransform                                  StartAttachTransform;                                     // 0x02A0(0x0030) (Edit, DisableEditOnTemplate, IsPlainOldData)
	struct FTransform                                  StartUpdatedComponentTransform;                           // 0x02D0(0x0030) (Edit, DisableEditOnTemplate, IsPlainOldData)
	struct FVector                                     LocationRandomValue;                                      // 0x0300(0x000C) (Edit, DisableEditOnTemplate, IsPlainOldData)
	unsigned char                                      UnknownData06[0x4];                                       // 0x030C(0x0004) MISSED OFFSET
	struct FQuat                                       CurrentFrontQuat;                                         // 0x0310(0x0010) (Edit, DisableEditOnTemplate, IsPlainOldData)
	struct FRotator                                    CurrentMovementFrontRotation;                             // 0x0320(0x000C) (Edit, DisableEditOnTemplate, IsPlainOldData)
	struct FRotator                                    CurrentOrbitRotation;                                     // 0x032C(0x000C) (Edit, DisableEditOnTemplate, IsPlainOldData)
	unsigned char                                      UnknownData07[0x8];                                       // 0x0338(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class JackGame.JackActionEffectMovementComponent");
		return ptr;
	}


	void Stop();
	void Play(const struct FJackAttachInfo& StartAttachInfo, const struct FJackAttachInfo& EndAttachInfo);
};


// Class JackGame.JackActionExec
// 0x0548 (0x08E0 - 0x0398)
class AJackActionExec : public AActor
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0398(0x0008) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnPlayDelegate;                                           // 0x03A0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnPlayCameraDelegate;                                     // 0x03B0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnCastEnterDelegate;                                      // 0x03C0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnShotEnterDelegate;                                      // 0x03D0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnHitDelegate;                                            // 0x03E0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnHitCompleteDelegate;                                    // 0x03F0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnBPStateDelegate;                                        // 0x0400(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnPlayCompleteDelegate;                                   // 0x0410(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData01[0xE0];                                      // 0x0420(0x00E0) MISSED OFFSET
	TWeakObjectPtr<class UJackGameCharacter>           Caster;                                                   // 0x0500(0x0008) (Edit, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData)
	struct FName                                       ActionID;                                                 // 0x0508(0x0008) (Edit, BlueprintVisi, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData)
	struct FJackActionData                             ActionData;                                               // 0x0510(0x00B0) (Edit, BlueprintVisi, BlueprintReadOnly, DisableEditOnTemplate, Transient)
	struct FJackActionPlayParam                        ActionPlayParam;                                          // 0x05C0(0x0290) (Edit, BlueprintVisi, BlueprintReadOnly, DisableEditOnTemplate, Transient)
	struct FVector                                     CasterOriginLocation;                                     // 0x0850(0x000C) (Edit, DisableEditOnTemplate, Transient, IsPlainOldData)
	bool                                               bConsumeDouguDisable;                                     // 0x085C(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bPlayCameraFrame;                                         // 0x085D(0x0001) (Edit, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData)
	bool                                               bShotStarted;                                             // 0x085E(0x0001) (Edit, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData)
	bool                                               bHitComplete;                                             // 0x085F(0x0001) (Edit, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData)
	bool                                               bPlayJumonHansyaEffect;                                   // 0x0860(0x0001) (Edit, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData)
	bool                                               bPlayedCamera;                                            // 0x0861(0x0001) (Edit, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData)
	bool                                               bBackJumpPlaying;                                         // 0x0862(0x0001) (Edit, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData)
	bool                                               bFreeMoveOriginLocationCanceled;                          // 0x0863(0x0001) (Edit, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x0864(0x0004) MISSED OFFSET
	TArray<EJackActionExecStateType>                   StateTransitions;                                         // 0x0868(0x0010) (Edit, ZeroConstructor, DisableEditOnTemplate, Transient)
	bool                                               bBPStateComplete;                                         // 0x0878(0x0001) (Edit, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData)
	unsigned char                                      UnknownData03[0x7];                                       // 0x0879(0x0007) MISSED OFFSET
	struct FJackActionMessageArg                       MessageArg;                                               // 0x0880(0x0020) (Edit, DisableEditOnTemplate, Transient)
	TWeakObjectPtr<class UJackActionMessageInfo>       MessageInfo_Koudou;                                       // 0x08A0(0x0008) (Edit, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData)
	class UJackActionWaitChecker*                      ActionWaitChecker;                                        // 0x08A8(0x0008) (Edit, ExportObject, ZeroConstructor, Transient, EditConst, InstancedReference, IsPlainOldData)
	class UJackStreamObjectsHolder*                    ResourceHolder;                                           // 0x08B0(0x0008) (Edit, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData)
	class UAnimMontage*                                AnimMontageCast;                                          // 0x08B8(0x0008) (Edit, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData)
	class UAnimMontage*                                AnimMontageShot;                                          // 0x08C0(0x0008) (Edit, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData)
	unsigned char                                      UnknownData04[0x18];                                      // 0x08C8(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class JackGame.JackActionExec");
		return ptr;
	}


	void SubtractItemInActionPlayParam();
	class AJackMonsterCharacter* SpawnZouenMonster(const struct FName& MonsterID, const struct FVector& SpawnLocation, const struct FRotator& SpawnRotation);
	void SetupFieldModeStateTransition(bool bOnlyInField);
	void SetNifuramuCharacterArray(TArray<class UJackGameCharacter*> GameCharacterArray);
	void SetNifuramuCharacter(class UJackGameCharacter* GameCharacter, bool bToubatsuEnable);
	void SetNifuramuCasterCharacter();
	void SetBPStateComplete();
	void SerifuWindowMessageDelegate(class UJackUMGSerifuWindowController* Sender, const struct FName& CurrentTextID, TEnumAsByte<EJackTextDelegateType> DelegateType, int Page, int Line, int Index);
	void SerifuScriptDelegate(class UJackUMGSerifuWindowController* Sender, const struct FName& CurrentTextID, TEnumAsByte<EJackMessageScriptEventType> DelegateType, const struct FString& StringParam);
	void SendCommandNakamayobi(class AJackCharacter* Actor);
	void ResetStateTransition();
	void RemoveStateTransition(EJackActionExecStateType StateType);
	void RemoveBattleCharacterCompletely(class UJackGameCharacter* GameCharacter, bool bToubatsuEnable);
	void RegisterTextDelegate(class UJackUMGSerifuWindowController* InController, class AJackCharacter* InTarget);
	void RegisterReservedEffect(bool bCastOrShot, bool bActionEffect2Only);
	void PushStateTransition(EJackActionExecStateType StateType, bool bHead);
	void PlayBattleVoice(class AJackCharacter* InTarget, const struct FName& InVoiceID);
	void PlayActionMessageWithTextId(const struct FName& TextID);
	void PlayActionMessage(EJackActionTextType TextType);
	void NotifyFireReservedEffect(bool bInActionEffect, bool bInProjectile, bool bInBurstEffect, bool bInParticleSystem);
	void NotifyActionHit();
	EJackActionExecStateType NextStateTransition(bool bBack);
	bool IsConsumeAction();
	void InsertStateTransition(EJackActionExecStateType StateType, EJackActionExecStateType InsertPositionStateType);
	TArray<class UJackGameCharacter*> GetTargetGameCharacters();
	class UJackGameCharacter* GetTargetGameCharacter();
	TArray<class AJackCharacter*> GetTargetCharacters();
	class AJackCharacter* GetTargetCharacter();
	TArray<class AJackCharacter*> GetSynchronizeCharacters();
	int GetStateTransitionNum();
	TArray<EJackActionExecStateType> GetStateTransitionBP();
	struct FName GetShotAnimMontageKey();
	TArray<struct FJackMessageArgumentData> GetMessageArgs();
	class UJackGameCharacter* GetCasterGameCharacter();
	class AJackCharacter* GetCasterCharacter();
	bool GetCasterChangeVariantForm();
	float GetBattleParameterInoriNoYubiwaProb();
	struct FJackActionPlayParam GetActionPlayParamBP();
	void Delegate__DelegateSignature();
	void ConsumeMP();
	void ChangeState(EJackActionExecStateType StateType);
	void BattleActionCameraPlayStart(const struct FName& ActionCameraID);
};


// Class JackGame.JackActionExec_ActionHit
// 0x0000 (0x08E0 - 0x08E0)
class AJackActionExec_ActionHit : public AJackActionExec
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class JackGame.JackActionExec_ActionHit");
		return ptr;
	}

};


// Class JackGame.JackActionExec_NoShot
// 0x0000 (0x08E0 - 0x08E0)
class AJackActionExec_NoShot : public AJackActionExec
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class JackGame.JackActionExec_NoShot");
		return ptr;
	}

};


// Class JackGame.JackActionExec_BunnyNoMamori
// 0x0010 (0x08F0 - 0x08E0)
class AJackActionExec_BunnyNoMamori : public AJackActionExec_NoShot
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x08E0(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class JackGame.JackActionExec_BunnyNoMamori");
		return ptr;
	}


	void OnTenNoKoeMessageEnd();
	void OnPlay();
	void OnHitComplete();
};


// Class JackGame.JackActionExec_Bunsin
// 0x0000 (0x08E0 - 0x08E0)
class AJackActionExec_Bunsin : public AJackActionExec
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class JackGame.JackActionExec_Bunsin");
		return ptr;
	}


	void OnPlay();
};


// Class JackGame.JackActionExec_Destruction
// 0x0000 (0x08E0 - 0x08E0)
class AJackActionExec_Destruction : public AJackActionExec
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class JackGame.JackActionExec_Destruction");
		return ptr;
	}

};


// Class JackGame.JackActionExec_DevilMode
// 0x0000 (0x08E0 - 0x08E0)
class AJackActionExec_DevilMode : public AJackActionExec
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class JackGame.JackActionExec_DevilMode");
		return ptr;
	}

};


// Class JackGame.JackActionExec_FieldMode
// 0x0000 (0x08E0 - 0x08E0)
class AJackActionExec_FieldMode : public AJackActionExec
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class JackGame.JackActionExec_FieldMode");
		return ptr;
	}

};


// Class JackGame.JackActionExec_M_Nigeru
// 0x0000 (0x08E0 - 0x08E0)
class AJackActionExec_M_Nigeru : public AJackActionExec
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class JackGame.JackActionExec_M_Nigeru");
		return ptr;
	}

};


// Class JackGame.JackActionExec_Nusumu
// 0x0000 (0x08E0 - 0x08E0)
class AJackActionExec_Nusumu : public AJackActionExec
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class JackGame.JackActionExec_Nusumu");
		return ptr;
	}

};


// Class JackGame.JackActionExec_Nusumu_Bunsin
// 0x0000 (0x08E0 - 0x08E0)
class AJackActionExec_Nusumu_Bunsin : public AJackActionExec_Bunsin
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class JackGame.JackActionExec_Nusumu_Bunsin");
		return ptr;
	}

};


// Class JackGame.JackActionExec_RemoveTurnQueue
// 0x0000 (0x08E0 - 0x08E0)
class AJackActionExec_RemoveTurnQueue : public AJackActionExec
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class JackGame.JackActionExec_RemoveTurnQueue");
		return ptr;
	}


	void OnPlay();
};


// Class JackGame.JackActionExec_RensouDan
// 0x0040 (0x0920 - 0x08E0)
class AJackActionExec_RensouDan : public AJackActionExec
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x08E0(0x0008) MISSED OFFSET
	struct FName                                       CallLocatorTagName;                                       // 0x08E8(0x0008) (Edit, BlueprintVisi, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                NeedToSpawnCount;                                         // 0x08F0(0x0004) (BlueprintVisi, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x08F4(0x0004) MISSED OFFSET
	TArray<class AJackLocator*>                        ZouenLocators;                                            // 0x08F8(0x0010) (BlueprintVisi, BlueprintReadOnly, ZeroConstructor, Transient)
	unsigned char                                      UnknownData02[0x18];                                      // 0x0908(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class JackGame.JackActionExec_RensouDan");
		return ptr;
	}


	void SpawnZouen();
	void OnPlay_CheckFirst();
};


// Class JackGame.JackActionExec_SwitchStance
// 0x0010 (0x08F0 - 0x08E0)
class AJackActionExec_SwitchStance : public AJackActionExec
{
public:
	TArray<class AActor*>                              SwitchStanceLocators;                                     // 0x08E0(0x0010) (Edit, BlueprintVisi, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class JackGame.JackActionExec_SwitchStance");
		return ptr;
	}


	void OnPlayActionExec();
	class AActor* GetSwitchLocator(const struct FName& InTagName);
	void ApplyTroopLocations(const struct FVector& InMonsterTroop, const struct FVector& InPlayerTroop);
};


// Class JackGame.JackActionExec_TenkiYohou
// 0x0000 (0x08E0 - 0x08E0)
class AJackActionExec_TenkiYohou : public AJackActionExec
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class JackGame.JackActionExec_TenkiYohou");
		return ptr;
	}

};


// Class JackGame.JackTask
// 0x0008 (0x0040 - 0x0038)
class UJackTask : public UObject
{
public:
	int                                                Scene;                                                    // 0x0038(0x0004) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	float                                              SceneTime;                                                // 0x003C(0x0004) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class JackGame.JackTask");
		return ptr;
	}

};


// Class JackGame.JackTaskActionHitExec
// 0x0030 (0x0070 - 0x0040)
class UJackTaskActionHitExec : public UJackTask
{
public:
	TWeakObjectPtr<class UJackGameCharacter>           CasterGameCharacter;                                      // 0x0040(0x0008) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	TWeakObjectPtr<class AJackActionEffect>            ActionEffect;                                             // 0x0048(0x0008) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	int                                                HitGroupCount;                                            // 0x0050(0x0004) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	bool                                               bInitialized;                                             // 0x0054(0x0001) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
